{
  "1.0.0": {
    "en": "Create apps supported by ThirdReality devices."
  },
  "1.0.2": {
    "en": "add support for Multi Function Night Light and change some config files."
  },
  "1.0.3": {
    "en": "Add support for Homey Bridge"
  },
  "1.0.4": {
    "en": "Add support for vibration sensor and button flow."
  },
  "1.0.5": {
    "en": "Add support for Garage Door Tilt Sensor and Temperature and Humidity Sensor Lite"
  },
  "1.0.6": {
    "en": "Added support for startup ON/OFF for Smart Plug (V1, v2, E2) and Multi-Function Night Light."
  },
  "1.0.7": {
    "en": "Fix system abnormalities that may be caused by the operation of the device when it is offline."
  },
  "1.0.8": {
    "en": "Added support for Smart Watering Kit, Smart Color Bulb ZL1, Smart Soil Moisture Sensor. Support temperature class equipment, add Fahrenheit display."
  },
  "1.0.9": {
    "en": "Remove the custom Fahrenheit capability."
  },
  "1.0.10": {
    "en": "Added manufacturerName of Smart Color Bulb ZL1 and modify the icon of some devices that do not meet the requirements."
  },
  "1.0.11": {
    "en": "Modify the manufacturerName of all devices. And Added support for Smart Motion Sensor R1."
  },
  "1.0.12": {
    "en": "Modify the manufacturerName of old T&H Sensor Lite and Contact Sensor"
  },
  "1.0.13": {
    "en": "Optimized the issue that the brightness control of the colored bulb did not have a synchronized state."
  },
  "1.0.14": {
    "en": "Added support for Smart Dual Plug ZP1 and Smart Mechanical Keyboard MK1. Add the meter_power and reset summation delivered functions of existing plug devices."
  },
  "1.0.15": {
    "en": "Cancel the config report of the dual plug."
  },
  "1.0.16": {
    "en": "Added support for water shortage alarm in watering kit."
  },
  "1.0.17": {
    "en": "1. Provide users with the option to set the config report of the soil sensor and temperature and humidity sensor lite in Advanced Settings."
  },
  "1.0.18": {
    "en": "Added support for devices such as Smart WaterLeak KM1, Smart Garage Door Opener, and others. Also modified some attributes."
  }
}
